Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །རྡོ་རྗེའི་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་འཛིན་པར་བྱེད་དོ།
en: There is the vajra maṇḍala samādhi, through which one possesses the maṇḍala of all samādhis.

source: །ཆོས་ཐམས་ཅད་རོ་གཅིག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་བཅུད་འཛིན་པར་བྱེད་དོ།
en: There is the one flavor of all phenomena samādhi, through which one has the vital essence of all samādhis.

source: །རིན་ཆེན་རྒྱལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཡོ་བྱད་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བར་བྱེད་དོ།
en: There is the victory of jewels samādhi, through which there is the elimination of all afflictions concerning requisites.

source: །ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་། པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པར་སྟོན་པར་བྱེད་དོ།
en: There is the birthlessness of all phenomena samādhi, which reveals the birthlessness and noncessation of all phenomena.

source: །རྣམ་པར་སྣང་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལམ་མེ་ལྷན་ནེ་ལྷང་ངེར་བྱེད་དོ།
en: There is the illumination samādhi, through which there is the appearance, brightening, and illumination of all samādhis.

source: །ཆོས་ཐམས་ཅད་འགག་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་རྣམ་པར་འབྱེད་པར་བྱེད་དོ།
en: There is the noncessation of all phenomena samādhi, which divides all samādhis.

source: །ཚོལ་བ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་གྱི་ཆོས་རྣམས་ནམ་ཡང་ཚོལ་བར་མི་བྱེད་དོ།
en: There is the no seeking samādhi, through which one never seeks the qualities of samādhi in all samādhis.

source: །གནས་ལ་རྟེན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་གནས་པའི་ཆོས་ནམ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the no dependence upon a basis samādhi, through which one never sees the presence of phenomena within all samādhis.

source: །ནམ་མཁའ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ནམ་མཁའི་ངོ་བོ་ཉིད་ལྟ་བུར་སྙིང་པོ་མེད་པ་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the same as space samādhi, through which one sees that all samādhis have no essence and have the nature of space.

source: །སེམས་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་སྤོང་བར་བྱེད་དོ།
en: There is the no mind samādhi, through which there is the elimination of mind and mental events in all samādhis.

source: །གཟུགས་མུ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་གཟུགས་ཀུན་ཏུ་སྣང་བར་བྱེད་དོ།
en: There is the limitless form samādhi, through which all forms are illuminated.

source: །དྲི་མ་མེད་པའི་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྒྲོན་མ་བཞིན་དུ་བྱེད་དོ།
en: There is the stainless lamp samādhi, through which there is the brightness of a lamp in all samādhis.

source: །ཆོས་ཐམས་ཅད་མུ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཡེ་ཤེས་མུ་མེད་པར་སྟོན་པར་བྱེད་དོ།
en: There is the infinity of all phenomena samādhi, through which there is revealed infinite wisdom in all samādhis.

source: །གློག་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཤེས་པ་མུ་མེད་པ་སྟོན་པར་བྱེད་དོ།
en: There is the lightning flash samādhi, through which there is revealed infinite knowledge of all samādhis.

source: །འོད་ཐམས་ཅད་བྱེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་འོད་བྱེད་པའི་སྒོ་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: There is the illuminating all samādhi, through which is revealed the entrance to illumination in all samādhis.

source: །ཁམས་ཀྱི་མཐའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་མཐའ་མེད་པ་ཐམས་ཅད་རྣམ་པར་ཤེས་པར་བྱ་བའི་ཕྱིར་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: There is the entirety of elements samādhi, through which there is revealed the way to know infinite samādhis.

source: །ཏིང་ངེ་འཛིན་དག་པ་དམ་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་གྱི་ཆོས་རྣམས་ལས་སྟོང་པ་ཉིད་རྗེས་སུ་ཐོབ་པར་བྱེད་དོ།
en: There is the samādhi of sublime purity samādhi, through which there is the attainment of emptiness among the qualities of samādhis.

source: །ལྷུན་པོ་ལྟར་བཀྲ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་གསོག་ཉིད་དུ་ཀུན་ཏུ་སྟོན་པར་བྱེད་དོ།
en: There is the brightness of Meru samādhi, through which is revealed the nullity in all phenomena.

source: །འོད་དྲི་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་དྲི་མ་སེལ་བར་བྱེད་དོ།
en: There is the stainless light samādhi, through which stains are eliminated from all samādhis.

source: །ཆོས་ཐམས་ཅད་ཀྱི་བརྡའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་མ་འདྲེས་པ་ཉིད་དུ་ཡང་དག་པར་སྟོན་པར་བྱེད་དོ།
en: There is the distinguishing all phenomena samādhi, which reveals the uniqueness of all samādhis.

source: །དགའ་བ་བྱེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་དགའ་བ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ།
en: There is the giving joy samādhi, through which there is the attainment of joy in all samādhis.

source: །ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ལ་རྣམ་པར་རྩེ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ངོ་བོ་ཉིད་མི་དམིགས་པ་སྟོན་པར་བྱེད་དོ།
en: There is the enjoyment of the nature of all phenomena samādhi, which reveals the absence of an object of a perceived nature in all samādhis.

source: །གློག་འགྱུར་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་མི་ཟད་པ་ཉིད་སྟོན་པར་བྱེད་དོ།
en: There is the lightning flash samādhi, which reveals the imperishability of all samādhis.

source: །ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་གཡེང་བ་མེད་ཅིང་རྡུལ་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཤེས་པ་རྡུལ་དང་བྲལ་བ་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: There is the purity of being undistracted by all phenomena samādhi, which reveals the spotless knowledge of all samādhis.

source: །མི་ཟད་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཟད་པ་མེད་པ་དང་། ཟད་པ་མེད་པ་མ་ཡིན་པ་ཡང་དག་པར་སྟོན་པར་བྱེད་དོ།
en: There is the imperishable samādhi, which reveals that all samādhis are neither perishable nor imperishable.

source: །ཆོས་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་ཅིང་རྣམ་པར་དག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་མིག་ཡོར་ལྟ་བུར་སྟོན་པར་བྱེད་དོ།
en: There is the purity of the inconceivability of all phenomena samādhi, which reveals all phenomena to be like illusions.

source: །གཟི་བརྗིད་ཡོད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཡེ་ཤེས་འབར་བར་བྱེད་དོ།
en: There is the radiant samādhi, through which wisdom shines in all samādhis.

source: །ཟད་པ་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཟད་པ་མེད་པ་དང་། ཉམས་པ་མེད་པར་སྟོན་པར་བྱེད་དོ།
en: There is the unending samādhi, which reveals all samādhis to never perish or cease.

source: །མི་གཡོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་གཡོ་བར་མི་བྱེད། འགུལ་བར་མི་བྱེད། འཕྲོ་བར་མི་བྱེད་དོ།
en: There is the unwavering samādhi, through which one does not waver, does not shake, and does not dissipate in the midst of all phenomena.

source: །རྣམ་པར་འཕེལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་ཤེས་བྱ་རྣམ་པར་འཕེལ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the increase samādhi, through which one sees the increase of what is known within all meditative states and all samādhis.

source: །ཉི་མའི་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་འོད་ཟེར་གྱི་སྒོ་དག་འགྱེད་པར་བྱེད་དོ།
en: There is the lamp of the sun samādhi, which opens the doorways of light rays in all samādhis.

source: །ཟླ་བ་དྲི་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྣང་བར་བྱེད་དོ།
en: There is the stainless moon samādhi, which illuminates all samādhis.

source: །སྣང་བ་དག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ།
en: There is the pure light samādhi, through which there is the attainment of the four kinds of knowledge within each samādhi.

source: །བྱ་བ་དང་མི་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་བྱ་བ་དང་མི་བྱ་བའི་བྱ་བ་བྱེད་ཅིང་ཡེ་ཤེས་རྟོགས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the both action and nonaction samādhi, through which one does the activity that is both action and nonaction and one also truly sees the summit of wisdom.

source: །རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ངེས་པར་འབྱེད་པར་བྱེད་ཅིང་གང་ལ་འབྱེད་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the vajra-like samādhi, through which one differentiates all phenomena, but without seeing that which is differentiated.

source: །སེམས་གནས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་སེམས་གཡོ་བར་མི་བྱེད། འགུལ་བར་མི་བྱེད། སྣང་བར་མི་བྱེད་ཅིང་གནོད་པར་འགྱུར་བ་ཡང་མེད་ལ། དེ་འདི་སྙམ་དུ་འདི་ནི་སེམས་ཡིན་ནོ་སྙམ་དུ་ཡང་མི་སེམས་པར་བྱེད་དོ།
en: There is the stable mind samādhi, through which the mind does not waver, does not shake, does not cause appearances, is unharmed, and in which one does not think, “This is the mind.”

source: །ཀུན་ཏུ་སྣང་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྣང་བ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the complete light samādhi, through which one sees light in all samādhis.

source: །རབ་ཏུ་གནས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རབ་ཏུ་གནས་པ་ཉིད་ཀྱིས་རབ་ཏུ་གནས་པར་བྱེད་དོ།
en: There is the perfect stability samādhi, through which one remains in perfect stability in all samādhis.

source: །རིན་ཆེན་བརྩེགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རིན་པོ་ཆེ་བརྩེགས་པ་ལྟ་བུར་ཀུན་ཏུ་སྣང་བར་བྱེད་དོ།
en: There is the heap of jewels samādhi, through which one sees a radiance like that of a heap of jewels in all samādhis.

source: །ཆོས་དམ་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཕྱག་རྒྱ་འདེབས་པར་བྱེད་ཅིང་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་མཉམ་པ་ཉིད་མ་གཏོགས་པའི་ཆོས་འགའ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the excellent seal of phenomena samādhi, which seals all samādhis, and because of the equality of all phenomena, one does not see any phenomenon that does not have that equality.

source: །དགའ་བ་སྤོང་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་དགའ་བ་སྤོང་བར་བྱེད་དོ།
en: There is the eliminating joy samādhi, which eliminates joy toward all phenomena.

source: །ཆོས་ཀྱི་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་ཡི་གེ་མི་མཉམ་པ་ཉིད་རབ་ཏུ་འཐོབ་པར་བྱེད་དོ།
en: There is the lamp of the Dharma samādhi, through which unequaled words for all phenomena are attained.

source: །ཡི་གེ་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་ཡི་གེ་གཅིག་ཀྱང་མི་དམིགས་པར་བྱེད་དོ།
en: There is the devoid of letters samādhi, through which there is no conception of a single letter regarding all phenomena.

source: །དམིགས་པ་གཅོད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་དམིགས་པ་རྣམ་པར་གཅོད་པར་བྱེད་དོ།
en: There is the cutting through fixation samādhi, through which fixation on all phenomena is cut through.

source: །འགྱུར་བ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་འགྱུར་བ་མི་དམིགས་པར་བྱེད་དོ།
en: There is the changeless samādhi, through which there is no conception of change regarding all phenomena.

source: །རང་བཞིན་རྣམ་པར་དག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་ཕན་འདོགས་པ་མི་དམིགས་པར་བྱེད་དོ།
en: There is the pure nature samādhi, through which there is no conception of benefiting in phenomena.

source: །གནས་མེད་པར་རྒྱུ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་གནས་མི་དམིགས་པར་བྱེད་དོ།
en: There is the moving without location samādhi, through which there is no conception of a location regarding all phenomena.

source: །རབ་རིབ་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་མུན་པའི་ཡུལ་ལས་ཡང་དག་པར་འདའ་བར་བྱེད་དོ།
en: There is the absence of darkness samādhi, through which, without seeing the practice of any samādhi, darkness is completely transcended.

source: །ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཚོགས་སུ་གྱུར་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་བསྩགས་པ་སྤོང་བར་བྱེད་དོ།
en: There is the aggregation of all good qualities samādhi, through which one abandons accumulation regarding phenomena.

source: །སེམས་མེད་པར་གནས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་སེམས་ཞེས་བྱ་བ་མི་དམིགས་པར་བྱེད་དོ།
en: There is the stability without mind samādhi, through which there is no conception of mind regarding all phenomena.

source: །བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་རྟོགས་པར་བྱེད་དོ།
en: There is the aspects of enlightenment samādhi, through which there is the realization of all phenomena.

source: །དྲན་པ་རྣམ་པར་འཕྲོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་སྤོབས་པ་གྲངས་མེད་པ་ཐོབ་པར་བྱེད་དོ།
en: There is the emanation of mindfulness samādhi, through which there is the attainment of countless types of confidence in relation to all phenomena.

source: །དེ་བྱེད་པའི་ཤེས་པ་རྣམ་པར་དག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་མི་མཉམ་པ་དང་མཉམ་པ་ཉིད་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ།
en: There is the pure knowledge of what is done samādhi, through which there is the realization of equality and inequality in all phenomena.

source: །ཡེ་ཤེས་ཏོག་གི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཁམས་གསུམ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་བྱེད་དོ།
en: There is the summit of wisdom samādhi, through which there is the transcendence of all three realms.

source: །ཤེས་པ་ཉེ་བར་གཅོད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་རྣམ་པར་གཅོད་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the cutting through by knowledge samādhi, through which one sees the cutting through of all phenomena.

source: །ཡེ་ཤེས་རྣམ་པར་འཕྲོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲོ་བ་ཉིད་རྗེས་སུ་ཐོབ་པར་བྱེད་དོ།
en: There is the emanation of wisdom samādhi, through which there is the attainment of the emanation of the forms of all phenomena.

source: །གནས་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་གནས་སུ་གྱུར་པ་མེད་པ་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the absence of location samādhi, through which one sees that there is no location within all phenomena.

source: །བཀོད་པ་གཅིག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་འགའ་ཡང་གཉིས་སུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the single arrangement samādhi, through which one does not see any phenomenon as dual.

source: །རྣམ་པར་སྒྲུབ་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པར་བསྒྲུབ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the bringing about the aspects samādhi, through which one sees the bringing about of the aspects of all phenomena.

source: །སྲིད་པའི་གཞི་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ཐམས་ཅད་དུ་གཏོགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་ངེས་པར་འབྱེད་པའི་ཡེ་ཤེས་འཇུག་ཅིང་གང་ལ་འཇུག་པ་འགའ་ཡང་མི་རྙེད་པར་བྱེད་དོ།
en: There is the elimination of the entire foundation of existence samādhi, through which one enters the wisdom that has insight into all phenomena, without any acquisition of whatever has been entered into.

source: །བརྡ་དང་སྒྲ་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་སྒྲ་དང་བརྡ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་པར་བྱེད་དོ།
en: There is the engaging in signs and sounds samādhi, through which one penetrates into all signs and sounds.

source: །སྒྲ་དབྱངས་ཀྱི་ཡི་གེ་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ཡི་གེ་དང་བྲལ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the freedom from the syllables of speech samādhi, through which one sees all phenomena as free from syllables.

source: །ཡེ་ཤེས་ཀྱི་སྒྲོན་མ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་གཟི་བརྗིད་ཀྱིས་ལམ་མེ་ལྷན་ནེ་ལྷང་ངེར་བྱེད་དོ།
en: There is the possession of the lamp of wisdom samādhi, through which one shines with radiance and illuminates all samādhis.

source: །ཡེ་ཤེས་མཆོག་གི་མཚན་ཉིད་རྣམ་པར་བསྒྱིངས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་དག་པའི་མཚན་ཉིད་སྟོན་པར་བྱེད་དོ།
en: There is the arising of the qualities of supreme wisdom samādhi, which reveals the quality of purity in all phenomena.

source: །མངོན་པར་ཤེས་པ་མེད་པའི་མཚན་ཉིད་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་རིག་པ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the characteristic of non-cognition samādhi, through which one sees all phenomena without cognizing them.

source: །རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་དང་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པར་བྱེད་དོ།
en: There is the total supremacy samādhi, through which there is supremacy in every way regarding all phenomena and all samādhis.

source: །སྡུག་བསྔལ་ཐམས་ཅད་ཤིན་ཏུ་སྤོང་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་གནས་པ་མེད་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་དོ།
en: There is the complete elimination of all suffering samādhi, through which one does not perceive dependency regarding all phenomena.

source: །བྱེད་རྒྱུ་མི་ཟད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་ཟད་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the unceasing activity samādhi, through which one does not perceive cessation regarding all phenomena.

source: །གཟུངས་ཀྱི་གཞིའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་འཛིན་ཅིང་ཡང་དག་པ་ཉིད་དང་། ལོག་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the foundation of retention samādhi, through which one retains all samādhis and all phenomena and there is no perception of right and wrong.

source: །འགག་པ་དང་འགལ་བ་རབ་ཏུ་ཞི་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་དང་འཐུན་པ་དང་འགལ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the abatement of the prevention of cessation samādhi, through which one does not perceive that which is favorable or contrary in all phenomena.

source: །འོད་དྲི་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་འདུས་བྱས་ཀྱི་དྲི་མ་དང་བྲལ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བར་བྱེད་དོ།
en: There is the stainless light samādhi, through which one does not perceive freedom from the stains of the composite in all samādhis.

source: །སྙིང་པོ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་སྙིང་པོ་མེད་པ་མི་དམིགས་པར་བྱེད་དོ།
en: There is the acquisition of essence samādhi, through which one does not perceive the absence of essence in all phenomena.

source: །ཟླ་བ་ཉ་བ་དྲི་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: There is the stainless full moon samādhi, through which one is completely full of qualities in all samādhis.

source: །བཀོད་པ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་བཀོད་པ་ཆེན་པོ་དང་ལྡན་པར་བྱེད་དོ།
en: There is the great arrangement samādhi, through which one has a great arrangement in all samādhis.

source: །སྣང་བ་ཐམས་ཅད་རབ་ཏུ་འབྱེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི། ཆོས་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱིས་སྣང་བར་བྱེད་དོ།
en: There is the division of all lights samādhi, through which wisdom illuminates all phenomena.

source: །མཉམ་པ་ཉིད་རྣམ་པར་སྣང་བར་བྱེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྩེ་གཅིག་པ་ཉིད་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ།
en: There is the equal illumination of samādhis samādhi, through which there is the attainment of one-pointedness in all samādhis.

source: །ཉོན་མོངས་པ་མེད་པ་དང་ཉོན་མོངས་པ་དང་བཅས་པ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཉོན་མོངས་པ་མེད་པར་བྱེད་དོ།
en: There is the gathering of all absence of kleśas and possession of kleśas samādhi, through which there is no kleśa toward any phenomenon.

source: །རླུང་གི་གནས་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་གནས་པར་མི་བྱེད་དོ།
en: There is the abode of air samādhi, through which no basis is created regarding all phenomena.

source: །དེ་བཞིན་ཉིད་ལ་གནས་ཤིང་སེམས་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་བྱེད་དོ།
en: There is the abiding in the true nature without mind samādhi, through which there is no deviation from the true nature in all phenomena.

source: །ལུས་ཀྱི་སྐྱོན་ཡང་དག་པར་སེལ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་འཇིག་ཚོགས་མི་དམིགས་པར་བྱེད་དོ།
en: There is the elimination of all faults of the body samādhi, through which there is no perception of an existing body regarding all phenomena.

source: །དག་གི་སྐྱོན་རྣམ་པར་འཇིག་པས་ནམ་མཁའ་ལྟར་གྱུར་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་ངག་གི་ལས་མི་དམིགས་པར་བྱེད་དོ།
en: There is the destruction of all faults of the speech that becomes like space samādhi, through which the bodhisattva does not perceive the activity of speech regarding all phenomena.

source: །ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་ལ་རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཐམས་ཅད་ལ་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པ་ཉིད་རྗེས་སུ་ཐོབ་པར་འགྱུར་ཏེ།
en: The bodhisattva who remains in the liberation and stainlessness in space-like nonattachment samādhi attains space-like nonattachment toward all phenomena. “ ‘

source: དེ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པ་ཡིན་ནོ།
en: Those are the entrances to samādhis that I taught to the bodhisattva mahāsattvas who have entered the Mahāyāna. “ ‘

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚོགས་རྣམ་པར་དག་པའི་སྒོ་སྡུད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་གང་ཞེ་ན།
en: What is the Dharma teaching that includes the entranceways to the pure accumulations of the bodhisattva mahāsattvas? “ ‘

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱིན་པའི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of generosity results in the ripening of all beings. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཚོགས་ནི་དགོས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of diligence results in the fulfillment of all necessary activities. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པའི་ཚོགས་ནི་ཞེ་འགྲས་པའི་སེམས་མེད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of kindness results in having a mind without hostility. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེའི་ཚོགས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་སྐྱོ་བ་མེད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of compassion results in never being weary in ripening beings. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགའ་བའི་ཚོགས་ནི་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་དགའ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of rejoicing results in delight and rejoicing in those who like the Dharma. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགོན་པར་གནས་པའི་ཚོགས་ནི་དགེ་བའི་རྩ་བའི་ལས་བྱས་པ་ཆུད་མི་ཟ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of living in solitude results in not losing the good karma that has been created. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བློ་གྲོས་ཀྱི་ཚོགས་ནི་བློ་རབ་ཏུ་འབྱེད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of comprehension results in discernment through the intellect. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྟོགས་པའི་ཚོགས་ནི་དོན་གྱི་རྣམ་པ་རྗེས་སུ་རྟོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of realization results in the realization of meaning. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པ་ཉེ་བར་གཞག་པའི་ཚོགས་ནི། ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་། ཆོས་རྗེས་སུ་རྟོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the application of mindfulness results in awareness of the body, sensations, mind, and phenomena. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡང་དག་པར་སྤོང་བའི་ཚོགས་ནི་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བ་དང་དགེ་བའི་ཆོས་ཐམས་ཅད་སྒོམ་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of right abandonment results in the abandonment of all negative qualities and the cultivation of all good qualities. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཚོགས་ནི་ལུས་དང་སེམས་ཡང་བ་ཉིད་དུ་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the bases of miraculous powers results in being light in body and mind. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབང་པོའི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the powers results in the perfection of the powers of all beings. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་ནི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་རྗེས་སུ་རྟོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the factors for enlightenment results in the realization of the nature of phenomena. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་གྱི་ཚོགས་ནི་ལམ་ངན་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the path results in the transcendence from all bad paths. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པའི་ཚོགས་ནི་མི་དགེ་བའི་ཆོས་རྣམས་སྤོང་ཞིང་མཐོ་རིས་སུ་སྐྱེ་བ་ཐོབ་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of truth results in moving away from all bad qualities and attaining rebirth in the higher existences. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅོད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of analytical knowledge results in cutting through the doubts of all beings. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོན་པའི་ཚོགས་ནི་ཤེས་པ་གཞན་ལ་རག་མ་ལས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of recourses results in having knowledge that is not dependent on others. “ ‘
